run/tutorials/freeSurfaceTests/oversetM5415/constant/oversetMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          oversetMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolation
{
    type injection;
}

holePatches ( bilgeKeel deck hull);

regions
(
    background
    {
        // Donor regions
        donorRegions ( hull );

        fringe
        {
            type manual;
            holes "backHole";
            acceptors "backFringe";
        }
//         fringe
//         {
//             type overlap;
//         }
    }
    hull
    {
        donorRegions ( background );

        fringe
        {
            type faceCells;
            patches ( x_min x_max y_min z_min z_max);
        }
    }
);


// ************************************************************************* //
