run/tutorials/freeSurfaceTests/oversetM5415/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oversetFaces
    {
        type overset;
        value uniform 0;
        coupledFringe yes;

        setHoleCellValue  yes;
        holeCellValue     0;
    }
    bottom
    {
        type zeroGradient;
    }
    hull
    {
        type zeroGradient;
    }
    bilgeKeel
    {
        type zeroGradient;
    }
    deck
    {
        type zeroGradient;
    }
    inlet
    {
        type zeroGradient;
    }
    outlet
    {
        type zeroGradient;
    }
    side
    {
        type zeroGradient;
    }
    symmetry
    {
        type symmetryPlane;
    }
    top
    {
        type zeroGradient;
    }
    x_max
    {
        type zeroGradient;
    }
    x_min
    {
        type zeroGradient;
    }
    y_max
    {
        type symmetryPlane;
    }
    y_min
    {
        type zeroGradient;
    }
    z_max
    {
        type zeroGradient;
    }
    z_min
    {
        type zeroGradient;
    }
}


// ************************************************************************* //
